{
  "architectures": [
    "UniAudioRVQQwen2_5VLMoEForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "codec_bos_value": 1026,
  "codec_channels": 12,
  "codec_delay_pattern": [
    0,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18
  ],
  "codec_eos_value": 1024,
  "codec_pad_value": 1025,
  "codec_placeholder_value": 151665,
  "codec_vocab_size": 1027,
  "drop_token_num_print": true,
  "eos_token_id": 151645,
  "ep_size": 1,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "image_token_id": 151655,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 128000,
  "max_window_layers": 70,
  "model_type": "uni_audio_rvq_qwen2_5vl_moe",
  "num_attention_heads": 16,
  "num_hidden_layers": 36,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "mrope_section": [
      16,
      24,
      24
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "text_config": {
    "architectures": [
      "Qwen2_5_VLForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "avg_hidden_states_last": false,
    "bos_token_id": 151643,
    "capacity_factor": 6.0,
    "drop_policy": "probs",
    "drop_token_num_print": true,
    "dynamic_intermediate_size": 2752,
    "enable_expert_tensor_parallelism": false,
    "eos_token_id": 151645,
    "ep_size": 1,
    "fixed_ep_size": 1,
    "fp32_gate": true,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "ignore_differentiable_router": true,
    "image_token_id": null,
    "initializer_range": 0.02,
    "input_jitter_noise": 0.01,
    "intermediate_size": 11008,
    "l_aux_weight": 0.025,
    "l_aux_weight_decay_steps": 10000,
    "layer_types": [
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention"
    ],
    "max_position_embeddings": 128000,
    "max_window_layers": 70,
    "min_capacity": 8,
    "min_l_aux_weight": 0.001,
    "mlp_dynamic_expert_num": 8,
    "mlp_dynamic_null_expert_num": 1,
    "mlp_dynamic_top_k": 0.0,
    "mlp_dynamic_top_p": 0.7,
    "mlp_fixed_expert_num": 2,
    "model_type": "qwen2_5_vl_moe_text",
    "num_attention_heads": 16,
    "num_hidden_layers": 36,
    "num_key_value_heads": 2,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "mrope_section": [
        16,
        24,
        24
      ],
      "rope_type": "default",
      "type": "default"
    },
    "rope_theta": 1000000.0,
    "router_jitter_noise": 0.01,
    "shared_intermediate_size": 1376,
    "sliding_window": null,
    "token_drop": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "use_sliding_window": false,
    "video_token_id": null,
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vision_token_id": 151654,
    "vocab_size": 151676
  },
  "token_drop": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.1",
  "use_cache": true,
  "use_sliding_window": false,
  "video_token_id": 151656,
  "vision_config": {
    "depth": 32,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "in_channels": 3,
    "in_chans": 3,
    "initializer_range": 0.02,
    "intermediate_size": 3420,
    "model_type": "qwen2_5_vl",
    "num_heads": 16,
    "out_hidden_size": 2048,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "temporal_patch_size": 2,
    "tokens_per_second": 2,
    "torch_dtype": "bfloat16",
    "window_size": 112
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "vision_token_id": 151654,
  "vocab_size": 151936
}
